; domain
(define (domain termes)
(:requirements :typing :negative-preconditions)
(:types
    numb - object
    position - object
)
(:predicates
    (height ?p - position ?h - numb)
    (at ?p - position)
    (has_block)
    ;
    ; static predicates
    (SUCC ?n1 - numb ?n2 - numb)
    (NEIGHBOR ?p1 - position ?p2 - position)
    (IS_DEPOT ?p - position)
)
(:action move
    :parameters (?from - position ?to - position ?h - numb)
    :precondition
    (and
        (at ?from)
        (NEIGHBOR ?from ?to)
        (height ?from ?h)
        (height ?to ?h)
    )
    :effect
    (and
        (not (at ?from))
        (at ?to)
    )
)

(:action move_up
    :parameters (?from - position ?hfrom - numb ?to - position ?hto - numb)
    :precondition
    (and
        (at ?from)
        (NEIGHBOR ?from ?to)
        (height ?from ?hfrom)
        (height ?to ?hto)
        (SUCC ?hto ?hfrom)
    )
    :effect
    (and
        (not (at ?from))
        (at ?to)
    )
)

(:action move_down
    :parameters (?from - position ?hfrom - numb ?to - position ?hto - numb)
    :precondition
    (and
        (at ?from)
        (NEIGHBOR ?from ?to)
        (height ?from ?hfrom)
        (height ?to ?hto)
        (SUCC ?hfrom ?hto)
    )
    :effect
    (and
        (not (at ?from))
        (at ?to)
    )
)

(:action place_block
    :parameters (?rpos - position ?bpos - position ?hbefore - numb ?hafter - numb)
    :precondition
    (and
        (at ?rpos)
        (NEIGHBOR ?rpos ?bpos)
        (height ?rpos ?hbefore)
        (height ?bpos ?hbefore)
        (SUCC ?hafter ?hbefore)
        (has_block)
        (not (IS_DEPOT ?bpos))
    )
    :effect
    (and
        (not (height ?bpos ?hbefore))
        (height ?bpos ?hafter)
        (not (has_block))
    )
)

(:action remove_block
    :parameters (?rpos - position ?bpos - position ?hbefore - numb ?hafter - numb)
    :precondition
    (and
        (at ?rpos)
        (NEIGHBOR ?rpos ?bpos)
        (height ?rpos ?hafter)
        (height ?bpos ?hbefore)
        (SUCC ?hbefore ?hafter)
        (not (has_block))
    )
    :effect
    (and
        (not (height ?bpos ?hbefore))
        (height ?bpos ?hafter)
        (has_block)
    )
)

(:action create_block
    :parameters (?p - position)
    :precondition
    (and
        (at ?p)
        (not (has_block))
        (IS_DEPOT ?p)
    )
    :effect
    (and
        (has_block)
    )
)

(:action destroy_block
    :parameters (?p - position)
    :precondition
    (and
        (at ?p)
        (has_block)
        (IS_DEPOT ?p)
    )
    :effect
    (and
        (not (has_block))
    )
)

)

; problem
(define (problem termes-00038-0036-4x3x3-random_towers_4x3_3_1_3)
(:domain termes)
; termes-00038-0036-4x3x3-random_towers_4x3_3_1_3
; Initial state:
;  0   0  R0D  0
;  0   0   0   0
;  0   0   0   0
; Goal state:
;  0   0   0   0
;  0   0   0   0
;  0   3   0   0
; Maximal height: 3
(:objects
    n0 - numb
    n1 - numb
    n2 - numb
    n3 - numb
    pos_0_0 - position
    pos_0_1 - position
    pos_0_2 - position
    pos_1_0 - position
    pos_1_1 - position
    pos_1_2 - position
    pos_2_0 - position
    pos_2_1 - position
    pos_2_2 - position
    pos_3_0 - position
    pos_3_1 - position
    pos_3_2 - position
)
(:init
    (height pos_0_0 n0)
    (height pos_0_1 n0)
    (height pos_0_2 n0)
    (height pos_1_0 n0)
    (height pos_1_1 n0)
    (height pos_1_2 n0)
    (height pos_2_0 n0)
    (height pos_2_1 n0)
    (height pos_2_2 n0)
    (height pos_3_0 n0)
    (height pos_3_1 n0)
    (height pos_3_2 n0)
    (at pos_2_0)
    (SUCC n1 n0)
    (SUCC n2 n1)
    (SUCC n3 n2)
    (NEIGHBOR pos_0_0 pos_1_0)
    (NEIGHBOR pos_0_0 pos_0_1)
    (NEIGHBOR pos_0_1 pos_1_1)
    (NEIGHBOR pos_0_1 pos_0_0)
    (NEIGHBOR pos_0_1 pos_0_2)
    (NEIGHBOR pos_0_2 pos_1_2)
    (NEIGHBOR pos_0_2 pos_0_1)
    (NEIGHBOR pos_1_0 pos_0_0)
    (NEIGHBOR pos_1_0 pos_2_0)
    (NEIGHBOR pos_1_0 pos_1_1)
    (NEIGHBOR pos_1_1 pos_0_1)
    (NEIGHBOR pos_1_1 pos_2_1)
    (NEIGHBOR pos_1_1 pos_1_0)
    (NEIGHBOR pos_1_1 pos_1_2)
    (NEIGHBOR pos_1_2 pos_0_2)
    (NEIGHBOR pos_1_2 pos_2_2)
    (NEIGHBOR pos_1_2 pos_1_1)
    (NEIGHBOR pos_2_0 pos_1_0)
    (NEIGHBOR pos_2_0 pos_3_0)
    (NEIGHBOR pos_2_0 pos_2_1)
    (NEIGHBOR pos_2_1 pos_1_1)
    (NEIGHBOR pos_2_1 pos_3_1)
    (NEIGHBOR pos_2_1 pos_2_0)
    (NEIGHBOR pos_2_1 pos_2_2)
    (NEIGHBOR pos_2_2 pos_1_2)
    (NEIGHBOR pos_2_2 pos_3_2)
    (NEIGHBOR pos_2_2 pos_2_1)
    (NEIGHBOR pos_3_0 pos_2_0)
    (NEIGHBOR pos_3_0 pos_3_1)
    (NEIGHBOR pos_3_1 pos_2_1)
    (NEIGHBOR pos_3_1 pos_3_0)
    (NEIGHBOR pos_3_1 pos_3_2)
    (NEIGHBOR pos_3_2 pos_2_2)
    (NEIGHBOR pos_3_2 pos_3_1)
    (IS_DEPOT pos_2_0)
)
(:goal
(and
    (height pos_0_0 n0)
    (height pos_0_1 n0)
    (height pos_0_2 n0)
    (height pos_1_0 n0)
    (height pos_1_1 n0)
    (height pos_1_2 n3)
    (height pos_2_0 n0)
    (height pos_2_1 n0)
    (height pos_2_2 n0)
    (height pos_3_0 n0)
    (height pos_3_1 n0)
    (height pos_3_2 n0)
    (not (has_block))
)
)
)

; plan
1. (create_block pos_2_0)
   added: (has_block)
   goals met: 11 of 13
2. (place_block pos_2_0 pos_2_1 n0 n1)
   deleted: (height pos_2_1 n0) (has_block)
   added: (height pos_2_1 n1)
   goals met: 11 of 13
3. (create_block pos_2_0)
   added: (has_block)
   goals met: 10 of 13
4. (move_up pos_2_0 n0 pos_2_1 n1)
   deleted: (at pos_2_0)
   added: (at pos_2_1)
   goals met: 10 of 13
5. (move_down pos_2_1 n1 pos_2_2 n0)
   deleted: (at pos_2_1)
   added: (at pos_2_2)
   goals met: 10 of 13
6. (place_block pos_2_2 pos_1_2 n0 n1)
   deleted: (height pos_1_2 n0) (has_block)
   added: (height pos_1_2 n1)
   goals met: 11 of 13
7. (remove_block pos_2_2 pos_2_1 n1 n0)
   deleted: (height pos_2_1 n1)
   added: (height pos_2_1 n0) (has_block)
   goals met: 11 of 13
8. (move pos_2_2 pos_2_1 n0)
   deleted: (at pos_2_2)
   added: (at pos_2_1)
   goals met: 11 of 13
9. (place_block pos_2_1 pos_1_1 n0 n1)
   deleted: (height pos_1_1 n0) (has_block)
   added: (height pos_1_1 n1)
   goals met: 11 of 13
10. (move pos_2_1 pos_2_0 n0)
   deleted: (at pos_2_1)
   added: (at pos_2_0)
   goals met: 11 of 13
11. (create_block pos_2_0)
   added: (has_block)
   goals met: 10 of 13
12. (place_block pos_2_0 pos_2_1 n0 n1)
   deleted: (height pos_2_1 n0) (has_block)
   added: (height pos_2_1 n1)
   goals met: 10 of 13
13. (create_block pos_2_0)
   added: (has_block)
   goals met: 9 of 13
14. (move_up pos_2_0 n0 pos_2_1 n1)
   deleted: (at pos_2_0)
   added: (at pos_2_1)
   goals met: 9 of 13
15. (move pos_2_1 pos_1_1 n1)
   deleted: (at pos_2_1)
   added: (at pos_1_1)
   goals met: 9 of 13
16. (place_block pos_1_1 pos_1_2 n1 n2)
   deleted: (height pos_1_2 n1) (has_block)
   added: (height pos_1_2 n2)
   goals met: 10 of 13
17. (move pos_1_1 pos_2_1 n1)
   deleted: (at pos_1_1)
   added: (at pos_2_1)
   goals met: 10 of 13
18. (move_down pos_2_1 n1 pos_2_0 n0)
   deleted: (at pos_2_1)
   added: (at pos_2_0)
   goals met: 10 of 13
19. (create_block pos_2_0)
   added: (has_block)
   goals met: 9 of 13
20. (move_up pos_2_0 n0 pos_2_1 n1)
   deleted: (at pos_2_0)
   added: (at pos_2_1)
   goals met: 9 of 13
21. (place_block pos_2_1 pos_1_1 n1 n2)
   deleted: (height pos_1_1 n1) (has_block)
   added: (height pos_1_1 n2)
   goals met: 10 of 13
22. (move_down pos_2_1 n1 pos_2_0 n0)
   deleted: (at pos_2_1)
   added: (at pos_2_0)
   goals met: 10 of 13
23. (create_block pos_2_0)
   added: (has_block)
   goals met: 9 of 13
24. (move_up pos_2_0 n0 pos_2_1 n1)
   deleted: (at pos_2_0)
   added: (at pos_2_1)
   goals met: 9 of 13
25. (move_up pos_2_1 n1 pos_1_1 n2)
   deleted: (at pos_2_1)
   added: (at pos_1_1)
   goals met: 9 of 13
26. (place_block pos_1_1 pos_1_2 n2 n3)
   deleted: (height pos_1_2 n2) (has_block)
   added: (height pos_1_2 n3)
   goals met: 11 of 13
27. (move_down pos_1_1 n2 pos_2_1 n1)
   deleted: (at pos_1_1)
   added: (at pos_2_1)
   goals met: 11 of 13
28. (remove_block pos_2_1 pos_1_1 n2 n1)
   deleted: (height pos_1_1 n2)
   added: (height pos_1_1 n1) (has_block)
   goals met: 10 of 13
29. (move_down pos_2_1 n1 pos_2_0 n0)
   deleted: (at pos_2_1)
   added: (at pos_2_0)
   goals met: 10 of 13
30. (destroy_block pos_2_0)
   deleted: (has_block)
   goals met: 11 of 13
31. (remove_block pos_2_0 pos_2_1 n1 n0)
   deleted: (height pos_2_1 n1)
   added: (height pos_2_1 n0) (has_block)
   goals met: 11 of 13
32. (destroy_block pos_2_0)
   deleted: (has_block)
   goals met: 12 of 13
33. (move pos_2_0 pos_1_0 n0)
   deleted: (at pos_2_0)
   added: (at pos_1_0)
   goals met: 12 of 13
34. (remove_block pos_1_0 pos_1_1 n1 n0)
   deleted: (height pos_1_1 n1)
   added: (height pos_1_1 n0) (has_block)
   goals met: 12 of 13
35. (move pos_1_0 pos_2_0 n0)
   deleted: (at pos_1_0)
   added: (at pos_2_0)
   goals met: 12 of 13
36. (destroy_block pos_2_0)
   deleted: (has_block)
   goals met: 13 of 13
